In [2]:
pip install mysql-connector-python
# To install mysql connector

Collecting mysql-connector-pythonNote: you may need to restart the kernel to use updated packages.
  Downloading mysql_connector_python-8.0.24-cp38-cp38-win_amd64.whl (794 kB)
Collecting protobuf>=3.0.0
  Downloading protobuf-3.15.8-py2.py3-none-any.whl (173 kB)
Requirement already satisfied: six>=1.9 in c:\users\1026774\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.24 protobuf-3.15.8

In [1]:
import mysql.connector

In [2]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="XXXXXXXX!" # Enter DB Password
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001C76D7F5C10>

In [3]:
mycursor = mydb.cursor()

mycursor.execute("SHOW DATABASES") # To list the databases in MySQL

In [4]:
for x in mycursor:
    print(x)         # Print the databases

('employees',)
('information_schema',)
('mtech',)
('mtech21',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [42]:
import mysql.connector

mydb1 = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Pa55word!",
  database="world"
)

In [31]:
print(mydb1)

<mysql.connector.connection.MySQLConnection object at 0x000001C76FA7A520>

In [44]:
mycursor = mydb1.cursor()
sql= 'SELECT * FROM world.city where ID=1'

In [45]:
mycursor.execute(sql)

In [46]:
myresult = mycursor.fetchall()

In [47]:
for x in myresult:
    print(x)          # Basic Select

(1, 'Kabul', 'AFG', 'Kabol', 1780000)

In [49]:
import mysql.connector as sql # Set sql as alias
import pandas as pd

In [77]:
db_conn = sql.connect( host="localhost",database='world',user='Viky',password='Password!')
db_cursor = db_conn.cursor()
db_cursor.execute('SELECT * FROM city')
table_rows = db_cursor.fetchall()
df = pd.DataFrame(table_rows)

# Connect to Database
#Export tables from database to a Data Frame in Pandas

In [58]:
df.head(2) # Data from the database

   0         1    2         3        4
0  1     Kabul  AFG     Kabol  1780000
1  2  Qandahar  AFG  Qandahar   237500

In [59]:
df.columns = ['ID','City_Name','Country_Code','Identifier','Pin Code'] 
# Rename columns to a meaningul name

In [60]:
df.head(2)

   ID City_Name Country_Code Identifier  Pin Code
0   1     Kabul          AFG      Kabol   1780000
1   2  Qandahar          AFG   Qandahar    237500

In [61]:
df.info() # Information about columns in the database

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            4079 non-null   int64
 1   City_Name     4079 non-null   object
 2   Country_Code  4079 non-null   object
 3   Identifier    4079 non-null   object
 4   Pin Code      4079 non-null   int64
dtypes: int64(2), object(3)
memory usage: 159.5+ KB

In [74]:
df.sort_values(by=['City_Name','Identifier'],ascending = True).head(3)

        ID             City_Name Country_Code           Identifier  Pin Code
669    670  A Coruña (La Coruña)          ESP              Galicia    243402
3096  3097                Aachen          DEU  Nordrhein-Westfalen    243825
3317  3318               Aalborg          DNK          Nordjylland    161161

In [69]:
df.pivot_table(index = 'Country_Code')

                  ID       Pin Code
Country_Code
ABW            129.0   29034.000000
AFG              2.5  583025.000000
AGO             58.0  512320.000000
AIA             61.5     778.000000
ALB             34.0  270000.000000
...              ...            ...
YEM           1782.5  290616.666667
YUG           1795.5  273688.375000
ZAF            733.5  345372.045455
ZMB           3165.0  353357.142857
ZWE           4070.5  455070.000000

[232 rows x 2 columns]

In [71]:
sql.version # Print the sql version